{
  "uid": "prayer-fajr-taqibat",
  "shortName": "تعقیبات نماز صبح",
  "fullName": "تعقیبات نماز صبح",
  "category": "prayer-taqibat",
  "zekrBody": [
    {
      "body": "بدان که تعقیب نماز صبح بیش از سایر نمازهاست و احادیث در فضیلت خصوص این تعقیب بسیار است. \r\n\r\nشیخ ابن فَهد در کتاب «عدّة الدّاعی» از امام رضا(علیه‌السلام) روایت کرده: هرکس پس از نماز صبح این کلمات را بر زبان جاری کند، حاجتی نخواهد مگر آنکه برایش فراهم شود و خداوند آنچه برای او اهمیت دارد برایش آماده سازد و آن کلمات این است: ",
      "alternateBodyList": [
        {
          "body": "بِسْمِ اللّٰهِ وَصَلَّى اللّٰهُ عَلى مُحَمَّدٍ وَآلِهِ، ﴿وَأُفَوِّضُ أَمْرِى إِلَى اللّٰهِ إِنَّ اللّٰهَ بَصِيرٌ بِالْعِبادِ، فَوَقَاهُ اللّٰهُ سَيِّئاتِ مَا مَكَرُوا﴾، ﴿لَاإِلٰهَ إِلّا أَنْتَ سُبْحانَكَ إِنِّى كُنْتُ مِنَ الظَّالِمِينَ، فَاسْتَجَبْنَا لَهُ وَ نَجَّيْناهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنْجِى الْمُؤْمِنِينَ﴾. ﴿حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكيلُ، فَانْقَلَبُوا بِنِعْمةٍ مِنَ اللّٰهِ وَفَضْلٍ لَمْ يَمْسَسْهُمْ سُوءٌ﴾، مَا شَاءَ اللّٰهُ لَا حَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ، مَا شَاءَ اللّٰهُ لَامَا شَاءَ النَّاسُ؛ ",
          "alternateBody": {
            "body": "به نام خدا، درود خدا بر محمد و خاندانش، «من کارم را به خداوند وامی گذارم؛ زیرا خداوند به بندگان بیناست؛ پس [در نتیجۀ واگذاری کارش به خداوند] خداوند او را از نقشه های شوم آنان [که می خواستند بر ضد وی به کار گیرند] حفظ کرد»، «معبودی جز تو نیست، تو [از هر عیب و نقصی] منزّهی، همانا من [به سبب کناره گیری از قومم بدون اِذن تو،] از ستمکاران بر خود هستم؛ پس دعایش را مستجاب کردیم و از اندوه نجاتش دادیم و مؤمنان را این گونه نجات می دهیم»، «خداوند برای ما بس است و او نیکو کارسازی است؛ [آنان بدون توجه به سخنان منافقان و عوامل نفوذی در جنگ «حَمراءُ الاَسَد» شرکت کردند]، پس با نعمت و احسانی بزرگ از سوی خدا [از جبهۀ جنگ] بازگشتند درحالی که هیچ آسیبی به آنان نرسیده بود» آنچه خدا بخواهد همان می‌شود، هیچ نیرو و توانی نیست جز به خدای [بلندمرتبه بزرگ]؛ آنچه خدا بخواهد آن می‌شود نه آنچه مردمان بخواهند؛ ",
            "languageKey": "fa"
          },
          "languageKey": "ar"
        },
        {
          "body": "مَا شَاءَ اللّٰهُ وَإِنْ كَرِهَ النَّاسُ، حَسْبِىَ الرَّبُّ مِنَ الْمَرْبُوبِينَ، حَسْبِىَ الْخالِقُ مِنَ الْمَخْلُوقِينَ، حَسْبِىَ الرَّازِقُ مِنَ الْمَرْزُوقِينَ، حَسْبِىَ اللّٰهُ رَبُّ الْعالَمِينَ، حَسْبِى مَنْ هُوَ حَسْبِى، حَسْبِى مَنْ لَمْ يَزَلْ حَسْبِى، حَسْبِى مَنْ كَانَ مُذْ كُنْتُ لَمْ يَزَلْ حَسْبِى، حَسْبِىَ اللّٰهُ، لَاإِلٰهَ إِلّا هُوَ، عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ. ",
          "alternateBody": {
            "body": "آنچه خدا بخواهد خواهد شد گرچه مردمان خوش ندارند، کفایت می‌کند پروردگار مرا از یاری پروردگان، آفریدگار مرا از کمک آفریده‌ها، روزی دهنده مرا از لطف روزی‌خواران، خدای یکتا پروردگار جهانیان کفایتم می‌کند، مرا بس است آن‌که به‌حقیقت مرا بس است، مرا بس است آن‌که همواره مرا بس است، مرا بس است آن‌که همواره از آنگاه‌که بوده‌ام مرا بس بوده است، مرا بس است خدایی که معبودی جز او نیست، بر او توکل نمودم و اوست پروردگار عرش بزرگ. ",
            "languageKey": "fa"
          },
          "languageKey": "ar"
        }
      ],
      "languageKey": "fa"
    },
    {
      "body": "مرحوم حاج ملاّ فتحعلی، سید محمّد سلطان‌آبادی را به تعریف و تمجید شایسته‌ای می ستود و چندی به زیارتش نائل شده و زمانی چند هم افتخار شاگردی او را داشت. سید محمّد سلطان‌آبادی در خواب‌ و بیداری به آخوند حاج ملاّ فتحعلی سه چیز را آموخته:\r\n\r\nاوّل: آنکه پس از سپیده‌دم دست بر سینه گذارد و هفتاد مرتبه «یا فَتّاح» [ای گشاینده مشکلات] گوید.\r\n\r\nدوّم: آنکه به خواندن این دعا که در کتاب کافی است پشتکار و استمرار به خرج دهد. دعایی که حضرت رسول(صلی‌الله‌علیه‌وآله) به فردی از صحابه خویش که به ناخوشی و پریشانی مبتلا بود آموخت و از برکت خواندن این دعا ناخوشی و پریشانی در اندک زمانی از او برطرف شد: ",
      "alternateBodyList": [
        {
          "body": "لَا حَوْلَ وَلَا قُوَّةَ إِلّا بِاللّٰهِ، تَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَايَمُوتُ، وَالْحَمْدُ لِلّٰهِ الَّذِى لَمْ يَتَّخِذْ وَلَداً، ولَمْ يَكُنْ لَهُ شَرِيكٌ فِى الْمُلْكِ، وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيراً. ",
          "alternateBody": {
            "body": "هیچ نیرو و توانى نیست جز به خداى [بلندمرتبه بزرگ]، توکل کردم بر زنده جاودانی که هرگز نمی‌میرد و ستایش خدای را که فرزندی نگرفته و در فرمانروایی شریکی برایش نبوده و از خواری و ناتوانی سرپرستی نداشته است و بی‌اندازه بزرگش شمار. ",
            "languageKey": "fa"
          },
          "languageKey": "ar"
        },
        {
          "body": " سوّم: آنکه به دنبال نمازهاى صبح دعایى (در بالا قبل از این دعا ذکر شد، بِسْمِ اللّٰهِ وَصَلَّى اللّٰهُ عَلى مُحَمَّدٍ وَآلِهِ...) که از شیخ بزرگوار ابن فهد روایت شده را بخواند.\r\n\r\nاین اوراد و اذکار را باید غنیمت شمرد و به خواندن آن‌ها اهتمام داشت و از فوائدش غفلت نکرد.\r\n---------------\r\n",
          "languageKey": "fa"
        }
      ],
      "languageKey": "fa"
    },
    {
      "body": "مرحوم «شیخ کلینى» به سند صحیح از امام صادق(علیه السلام) روایت کرده است که:\r\nهر کس بعد از نماز صبح صـد بار بگوید:",
      "alternateBodyList": [
        {
          "body": "ما شاءَ اللّهُ کانَ، لا حَوْلَ وَ لا قُوَّةَ اِلاَّ بِاللّهِ الْعَلِىِّ الْعَظیم،",
          "alternateBody": {
            "body": "هرچه که خدا خواهد، محقّق است، هیچ جنبش و نیرویى نیست، مگر با کمک خداوند بلندمرتبه با عظمت",
            "languageKey": "fa"
          },
          "languageKey": "ar"
        },
        {
          "body": "در آن روز هیچ ناگوارى نمى بیند.",
          "languageKey": "fa"
        }
      ],
      "languageKey": "fa"
    },
    {
      "body": "در روایتى دیگر نقل شده که هر کس بعد از نماز صبح صد بار بگوید:",
      "alternateBody": {
        "body": "اَللّهُمَّ صَلِّ عَلى مُحَمَّد وَ آلِ مُحَمَّد",
        "alternateBody": {
          "body": "خداوند او را از آتش جهنم حفظ فرماید.\r\n(بحارالانوار، ج 83، ص 133، ح 10.)",
          "languageKey": "fa"
        },
        "languageKey": "ar"
      },
      "languageKey": "fa"
    },
    {
      "body": "مطابق روایتى از امام على بن موسى الرضا(علیهما السلام) هر کس بعد از نماز صبح یکصد مرتبه بگوید:",
      "alternateBodyList": [
        {
          "body": "«بِسْمِ اللّهِ الرَّحْمنِ الرَّحیمِ، لا حَوْلَ وَ لا قُوَّةَ إلاّ بِاللّهِ الْعَلِىِّ الْعَظیم»",
          "languageKey": "ar"
        },
        {
          "body": "این ذکر به اسم اعظم از سیاهى چشم به سفیدى آن نزدیکتر است.(بحارالانوار، ج 83، ص 162، ح 41. )",
          "languageKey": "fa"
        }
      ],
      "languageKey": "fa"
    }
  ],
  "benefits": [
    {
      "body": " بدان که تعقیب نماز صبح بیش از سایر نمازهاست و احادیث در فضیلت خصوص این تعقیب بسیار است.\r\n\r\nاز امیرمؤمنان(علیه‌السلام) روایت شده: ذکر خدا بعد از نماز صبح تا طلوع آفتاب در به دست‌ آوردن روزی، سرعت‌بخش‌تر از سفر‌کردن برای تجارت بر روی زمین است.\r\nاز حضرت رسول(صلی‌الله‌علیه‌وآله) روایت شده: هرکه از طلوع صبح تا طلوع خورشید، در محلّ خواندن نماز خود قرار گیرد و به تعقیب مشغول باشد، خدا او را از آتش دوزخ برهاند.\r\n\r\nاز امام باقر(علیه‌السلام) نقل‌شده: شیطان لشگر روز خویش را از طلوع صبح تا طلوع خورشید پخش می‌کند و لشکر شب خویش را از غروب تا بر طرف شدن حمره مغربیه [سرخی موجود در افق مغرب]، بنابراین در این دو ساعت خدا را بسیار یاد کنید که در این دو زمان، شیطان آدمی را از ذکر خدا غافل می‌کند.\r\n\r\nبه سند صحیح روایت شده که امام رضا(علیه‌السلام) در خراسان، هنگامی که نماز صبح را می‌خواند تا طلوع خورشید در مصلاّی خویش می‌نشست و مشغول تعقیب بود، آنگاه کیسه چرمی برای آن حضرت می‌آوردند که در آن چند مسواک بود، به یک‌یک آنها مسواک می‌کرد، سپس مقداری کندُر می‌جوید، پس از آن قرآن تلاوت می‌کرد.\r\n\r\nاز حضرت رسول(صلی‌الله‌علیه‌وآله) روایت شده: هرکه از طلوع صبح تا طلوع خورشید مشغول تعقیب باشد، ثواب حجّ برای او می‌شود.\r\nدر حدیث قدسی وارد شده حق‌تعالی می‌فرماید: ای فرزند آدم مرا پس از صبح یک ساعت و پس از عصر یک ساعت یاد کن تا همه کارهای مهمّ تو را کفایت کنم.",
      "languageKey": "fa"
    }
  ],
  "source": [
    {
      "title": "مفاتیح الجنان"
    },
    {
      "title": "تعقیبات نماز صبح - متن و ترجمه استاد انصاریان",
      "url": "https://www.erfan.ir/mafatih8/%D8%AA%D8%B9%D9%82%DB%8C%D8%A8%D8%A7%D8%AA-%D9%86%D9%85%D8%A7%D8%B2-%D8%B5%D8%A8%D8%AD-%DA%A9%D9%84%DB%8C%D8%A7%D8%AA-%D9%85%D9%81%D8%A7%D8%AA%DB%8C%D8%AD-%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D9%86-%D8%A8%D8%A7-%D8%AA%D8%B1%D8%AC%D9%85%D9%87-%D8%A7%D8%B3%D8%AA%D8%A7%D8%AF-%D8%AD%D8%B3%DB%8C%D9%86-%D8%A7%D9%86%D8%B5%D8%A7%D8%B1%DB%8C%D8%A7%D9%86"
    },
    {
      "title": "تعقیبات مخصوص نماز صبح -… و ترجمه استاد انصاریان",
      "url": "https://www.erfan.ir/mafatih361/%D8%AA%D8%B9%D9%82%DB%8C%D8%A8%D8%A7%D8%AA-%D9%85%D8%AE%D8%B5%D9%88%D8%B5-%D9%86%D9%85%D8%A7%D8%B2-%D8%B5%D8%A8%D8%AD-%DA%A9%D9%84%DB%8C%D8%A7%D8%AA-%D9%85%D9%81%D8%A7%D8%AA%DB%8C%D8%AD-%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D9%86-%D8%A8%D8%A7-%D8%AA%D8%B1%D8%AC%D9%85%D9%87-%D8%A7%D8%B3%D8%AA%D8%A7%D8%AF-%D8%AD%D8%B3%DB%8C%D9%86-%D8%A7%D9%86%D8%B5%D8%A7%D8%B1%DB%8C%D8%A7%D9%86"
    },
    {
      "title": "تعقیبات نماز صبح - پایگاه اطلاع رسانی دفتر حضرت آیت الله العظمی مکارم شیرازی",
      "url": "https://makarem.ir/main.aspx?reader=1&lid=0&mid=30057&catid=6513&pid=61912"
    }
  ],
  "tags": [
    "prayer-taqibat"
  ],
  "zekrTimes": [
    "AfterMorningPrayer"
  ],
  "showZekrCounter": true
}